In [2]:
import pandas as pd
import numpy as np

In [3]:
int1=np.random.randint(10,size=5)
int2=np.random.randint(10,size=5)
int3=np.random.randint(10,size=5)

In [4]:
sozluk={"var1":int1,"var2":int2,"var3":int3}
sozluk

{'var1': array([0, 9, 5, 2, 5]),
 'var2': array([2, 1, 5, 8, 7]),
 'var3': array([3, 5, 4, 5, 6])}

In [6]:
df=pd.DataFrame(sozluk)
df

   var1  var2  var3
0     0     2     3
1     9     1     5
2     5     5     4
3     2     8     5
4     5     7     6

In [7]:
df[0:1]

   var1  var2  var3
0     0     2     3

In [12]:
df.index=[1,2,3,4,5]
df

   var1  var2  var3
1     0     2     3
2     9     1     5
3     5     5     4
4     2     8     5
5     5     7     6

In [14]:
df[1:5]

   var1  var2  var3
2     9     1     5
3     5     5     4
4     2     8     5
5     5     7     6

**Silme**

In [15]:
df.drop(2,axis=0)

   var1  var2  var3
1     0     2     3
3     5     5     4
4     2     8     5
5     5     7     6

In [16]:
df

   var1  var2  var3
1     0     2     3
2     9     1     5
3     5     5     4
4     2     8     5
5     5     7     6

In [18]:
df.drop(2,axis=0,inplace=True) #df den tümden silmek için inplace kullanılır

In [19]:
df

   var1  var2  var3
1     0     2     3
3     5     5     4
4     2     8     5
5     5     7     6

**Fancy ile silme**

In [20]:
l=[3,4]

In [21]:
df.drop(l,axis=0)

   var1  var2  var3
1     0     2     3
5     5     7     6

In [23]:
"var1" in df

True

In [24]:
s=["var1","var4","var2"]

In [30]:
for i in s:
    print(i in df)

True
False
True

**Değişken Ekleme**

In [34]:
int1=np.random.randint(10,size=5)
int2=np.random.randint(10,size=5)
int3=np.random.randint(10,size=5)

sozluk={"var1":int1,"var2":int2,"var3":int3}
sozluk

{'var1': array([5, 8, 7, 9, 3]),
 'var2': array([6, 7, 4, 7, 2]),
 'var3': array([2, 5, 3, 2, 6])}

In [35]:
df=pd.DataFrame(sozluk)
df

   var1  var2  var3
0     5     6     2
1     8     7     5
2     7     4     3
3     9     7     2
4     3     2     6

In [39]:
df["var4"]=df["var1"] / df["var2"]

In [40]:
df

   var1  var2  var3      var4
0     5     6     2  0.833333
1     8     7     5  1.142857
2     7     4     3  1.750000
3     9     7     2  1.285714
4     3     2     6  1.500000

**Değişken Silme**

In [46]:
df.drop("var3",axis=1)
#1 sütün 0 satır temsil eder

   var1  var2      var4
0     5     6  0.833333
1     8     7  1.142857
2     7     4  1.750000
3     9     7  1.285714
4     3     2  1.500000

In [47]:
df

   var1  var2  var3      var4
0     5     6     2  0.833333
1     8     7     5  1.142857
2     7     4     3  1.750000
3     9     7     2  1.285714
4     3     2     6  1.500000

In [49]:
df.drop("var3",axis=1, inplace=True)
df

   var1  var2      var4
0     5     6  0.833333
1     8     7  1.142857
2     7     4  1.750000
3     9     7  1.285714
4     3     2  1.500000

**Fancy Silme İşlemi**

In [50]:
l=["var1","var2"]

In [51]:
df.drop(l,axis=1)

       var4
0  0.833333
1  1.142857
2  1.750000
3  1.285714
4  1.500000